app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "stock-photo-139669245.jpg"], ["image_file_size", 169255], ["image_updated_at", "2017-06-28 23:20:51.419556"], ["updated_at", "2017-06-28 23:20:51.432066"], ["id", 13]]
---
	def update
		@article = Article.find(params[:id])
		@article.update(article_params)