app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("email", "crypted_password", "salt", "created_at", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @author.update(author_params)
---
UPDATE "authors" SET "salt" = ?, "crypted_password" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["salt", "ZcxM_-zvc-N9puasHE_k"], ["crypted_password", "$2a$10$VmAu7oaEa6kmTswt4rhnLutmxtzGa/v1kACWvzjctl1onGSHo/RK2"], ["updated_at", "2017-06-29 02:30:40.183248"], ["id", 1]]

  def destroy
    @author.destroy
---
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 1]]